/* 
 * 地区数据
 */
function Region(){
    this._select = "—请选择—";
    this._count = 34;
    this._city = new Array(this._count);
    this._city[0] = new Array(["安徽", "合肥", "宣城", "池州", "巢湖", "六安", "黄山", "安庆", "铜陵", "芜湖", "马鞍山", "滁州", "淮南", "蚌埠", "阜阳", "淮北", "宿州", "亳州"], ["1001", "101", "116", "115", "114", "113", "112", "111", "110", "109", "108", "107", "106", "105", "104", "103", "102", "117"]);
    this._city[1] = new Array(["北京", "北京"], ["1002", "118"]);
    this._city[2] = new Array(["重庆", "重庆"], ["1003", "119"]);
    this._city[3] = new Array(["福建", "厦门", "福州", "南平", "三明", "莆田", "泉州", "漳州", "龙岩", "宁德"], ["1004", "120", "121", "122", "123", "124", "125", "126", "127", "128"]);
    this._city[4] = new Array(["甘肃", "兰州", "定西", "平凉", "庆阳", "武威", "张掖", "酒泉", "天水", "白银", "金昌", "嘉峪关", "陇南"], ["1005", "129", "139", "138", "137", "136", "135", "134", "133", "132", "131", "130", "140"]);
    this._city[5] = new Array(["广东", "广州", "珠海", "中山", "江门", "佛山", "肇庆", "云浮", "阳江", "茂名", "东莞", "惠州", "汕尾", "深圳", "清远", "韶关", "河源", "梅州", "潮州", "汕头", "揭阳", "湛江"], ["1006", "141", "153", "154", "155", "156", "157", "158", "159", "160", "152", "151", "150", "142", "143", "144", "145", "146", "147", "148", "149", "161"]);
    this._city[6] = new Array(["广西", "南宁", "来宾", "河池", "百色", "崇左", "防城港", "北海", "钦州", "玉林", "贵港", "梧州", "柳州", "桂林", "贺州"], ["1007", "162", "174", "173", "172", "171", "170", "169", "168", "167", "166", "165", "164", "163", "175"]);
    this._city[7] = new Array(["贵州", "贵阳", "六盘水", "遵义", "安顺"], ["1008", "176", "177", "178", "179"]);
    this._city[8] = new Array(["海南", "海口", "三亚"], ["1009", "180", "181"]);
    this._city[9] = new Array(["河北", "石家庄", "廊坊", "沧州", "承德", "张家口", "邢台", "秦皇岛", "保定", "唐山", "邯郸", "衡水"], ["1010", "182", "191", "190", "189", "188", "187", "186", "185", "184", "183", "192"]);
    this._city[10] = new Array(["黑龙江", "哈尔滨", "牡丹江", "鸡西", "七台河", "双鸭山", "佳木斯", "鹤岗", "伊春", "大庆", "黑河", "齐齐哈尔", "绥化"], ["1011", "193", "203", "202", "201", "200", "199", "198", "197", "196", "195", "194", "204"]);
    this._city[11] = new Array(["河南", "郑州", "驻马店", "周口", "商丘", "南阳", "三门峡", "漯河", "许昌", "濮阳", "焦作", "新乡", "鹤壁", "安阳", "平顶山", "洛阳", "开封", "信阳"], ["1012", "205", "220", "219", "218", "217", "216", "215", "214", "213", "212", "211", "210", "209", "208", "207", "206", "221"]);
    this._city[12] = new Array(["湖北", "武汉", "宜昌", "荆州", "咸宁", "黄石", "鄂州", "黄冈", "孝感", "荆门", "襄樊", "十堰", "随州"], ["1013", "222", "232", "231", "230", "229", "228", "227", "226", "225", "224", "223", "233"]);
    this._city[13] = new Array(["湖南", "长沙", "怀化", "邵阳", "永州", "郴州", "衡阳", "湘潭", "株洲", "岳阳", "益阳", "常德", "张家界", "娄底"], ["1014", "234", "245", "244", "243", "242", "241", "240", "239", "238", "237", "236", "235", "246"]);
    this._city[14] = new Array(["内蒙古", "呼和浩特", "包头", "乌海", "赤峰", "呼伦贝尔", "通辽", "乌兰察布", "鄂尔多斯", "巴彦淖尔"], ["1015", "247", "248", "249", "250", "251", "252", "253", "254", "255"]);
    this._city[15] = new Array(["江苏", "南京", "无锡", "常州", "镇江", "南通", "泰州", "扬州", "盐城", "淮安", "宿迁", "连云港", "徐州", "苏州"], ["1016", "256", "267", "266", "265", "264", "263", "262", "261", "260", "259", "258", "257", "268"]);
    this._city[16] = new Array(["江西", "南昌", "宜春", "抚州", "上饶", "赣州", "萍乡", "新余", "鹰潭", "景德镇", "九江", "吉安"], ["1017", "269", "278", "277", "276", "275", "274", "273", "272", "271", "270", "279"]);
    this._city[17] = new Array(["吉林", "长春", "吉林", "白城", "松原", "四平", "辽源", "通化", "白山"], ["1018", "280", "281", "282", "283", "284", "285", "286", "287"]);
    this._city[18] = new Array(["辽宁", "沈阳", "锦州", "盘锦", "营口", "丹东", "鞍山", "辽阳", "本溪", "抚顺", "铁岭", "阜新", "朝阳", "大连", "葫芦岛"], ["1019", "288", "300", "299", "298", "297", "296", "295", "294", "293", "292", "291", "290", "289", "301"]);
    this._city[19] = new Array(["宁夏", "银川", "石嘴山", "吴忠", "中卫", "固原"], ["1020", "302", "303", "304", "305", "306"]);
    this._city[20] = new Array(["青海", "西宁", "玉树"], ["1021", "307", "308"]);
    this._city[21] = new Array(["山西", "太原", "临汾", "晋中", "吕梁", "忻州", "晋城", "长治", "阳泉", "朔州", "大同", "运城"], ["1022", "309", "318", "317", "316", "315", "314", "313", "312", "311", "310", "319"]);
    this._city[22] = new Array(["山东", "济南", "滨州", "莱芜", "泰安", "济宁", "枣庄", "临沂", "日照", "威海", "烟台", "潍坊", "淄博", "东营", "德州", "聊城", "青岛", "菏泽"], ["1023", "320", "335", "334", "333", "332", "331", "330", "329", "328", "327", "326", "325", "324", "323", "322", "321", "336"]);
    this._city[23] = new Array(["上海", "上海"], ["1024", "337"]);
    this._city[24] = new Array(["四川", "成都", "眉山", "资阳", "达州", "巴中", "攀枝花", "宜宾", "泸州", "自贡", "乐山", "内江", "遂宁", "广安", "南充", "德阳", "绵阳", "广元", "雅安"], ["1025", "338", "354", "353", "352", "351", "350", "349", "348", "347", "346", "345", "344", "343", "342", "341", "340", "339", "355"]);
    this._city[25] = new Array(["天津", "天津"], ["1026", "356"]);
    this._city[26] = new Array(["西藏", "拉萨"], ["1027", "357"]);
    this._city[27] = new Array(["新疆", "乌鲁木齐", "克拉玛依", "石河子", "阿拉尔", "图木舒克", "五家渠"], ["1028", "358", "359", "360", "361", "362", "363"]);
    this._city[28] = new Array(["云南", "昆明", "曲靖", "玉溪", "丽江", "昭通", "思茅", "临沧", "保山"], ["1029", "364", "365", "366", "367", "368", "369", "370", "371"]);
    this._city[29] = new Array(["浙江", "杭州", "温州", "台州", "金华", "衢州", "绍兴", "舟山", "嘉兴", "湖州", "宁波", "丽水"], ["1030", "372", "381", "380", "379", "378", "377", "376", "375", "374", "373", "382"]);
    this._city[30] = new Array(["陕西", "西安", "商洛", "榆林", "汉中", "宝鸡", "咸阳", "渭南", "铜川", "延安", "安康"], ["1031", "383", "391", "390", "389", "388", "387", "386", "385", "384", "392"]);
    this._city[31] = new Array(["台湾", "台北", "高雄", "基隆", "台中", "台南", "新竹", "嘉义"], ["1032", "393", "394", "395", "396", "397", "398", "399"]);
    this._city[32] = new Array(["香港", "香港"], ["1033", "400"]);
    this._city[33] = new Array(["澳门", "澳门"], ["1034", "401"]);
}
Region.prototype = {
    _set:function(object){
        if(object == null || typeof object != "object"){
            return false;
        }
        this._count = this._count+1;
        this._city[this._count] = new Array(object);
        return true;
    },
    _get:function(i){
        if(typeof i =="undefined"){
            return this._city;
        }
        if(isNaN(i)||i>this.length){
            return null;
        }
        return this._city[i];
    },
    _get_count:function(){
        return this._count;
    },
    _get_select:function(){
        return this._select;
    },
    _remove:function(i){
        if(isNaN(i)||i>this.length){
            return false;
        }
        this.splice(this._city,i);
        return true;
    }
}

