/*
 * 资质数据
 */
function EnterQuali(){
    this._select = "—请选择—";
    this._count =2;
    this._enquali = new Array(this._count);
    this._enquali[0] = new Array(["施工总承包企业资质", "房屋建筑工程", "通信工程", "市政公用工程", "化工石油工程", "冶炼工程", "矿山工程", "电力工程", "水利水电工程", "港口与航道工程", "铁路工程", "公路工程", "机电安装工程"], ["23", "25", "59", "58", "57", "56", "55", "30", "29", "28", "27", "26", "60"]);
    this._enquali[1] = new Array(["专业承包企业资质", "特种专业工程专业", "河湖整治工程专业", "水利水电机电设备安装工程专业", "水工金属结构制作与安装工程专业", "水工建筑物基础处理工程专业", "水上交通管制工程专业", "通航设备安装工程专业", "通航建筑工程专业", "航道工程专业", "港口装卸设备安装工程专业", "港口与海岸工程专业", "机场目视助航工程专业", "机场空管工程及航站楼弱点系统工程专业", "堤防工程专业", "水工大坝工程专业", "水工隧洞工程专业", "体育场地设施工程专业", "城市及道路照明工程专业", "城市轨道交通工程专业", "海洋石油工程专业", "无损检测专业", "管道工程专业", "化工石油设备管道安装工程专业", "冶炼机电设备安装工程专业", "炉窑工程专业", "核工程专业", "送变电工程专业", "火电设备安装工程专业", "机场场道工程专业", "铁路电气化工程专业", "金属门窗工程专业", "建筑防水工程专业", "消防设施工程专业", "电梯安装工程专业", "高耸构筑物工程专业", "钢结构工程专业", "园林古建筑工程专业", "混凝土预制构件专业", "预拌商品混凝土专业", "土石方工程专业", "地基与基础工程专业", "建筑幕墙工程专业", "预应力工程专业", "起重设备安装工程专业", "机电设备安装专业", "铁路铺轨架梁工程专业", "铁路电务工程专业", "公路交通工程专业", "公路路基工程专业", "公路路面工程专业", "隧道工程专业", "桥梁工程专业", "电子工程专业", "电信工程专业", "环保工程专业", "建筑智能化工程专业", "爆破与拆除工程专业", "建筑装修装饰工程专业"], ["24", "116", "100", "99", "98", "97", "96", "95", "94", "93", "92", "91", "90", "89", "101", "102", "103", "115", "114", "113", "112", "111", "110", "109", "108", "107", "106", "105", "104", "88", "87", "71", "70", "69", "68", "67", "66", "65", "64", "63", "62", "61", "32", "72", "73", "74", "86", "85", "84", "83", "82", "81", "80", "79", "78", "77", "76", "75", "31"]);

}
EnterQuali.prototype={
    _set:function(object){
        if(object == null || typeof object != "object"){
            return false;
        }
        this._count = this._count+1;
        this._enquali[this._count] = new Array(object);
        return true;
    },
    _get:function(i){
        if(typeof i =="undefined"){
            return this._enquali;
        }
        if(isNaN(i)||i>this.length){
            return null;
        }
        return this._enquali[i];
    },
    _get_count:function(){
        return this._count;
    },
    _get_select:function(){
        return this._select;
    },
    _remove:function(i){
        if(isNaN(i)||i>this.length){
            return false;
        }
        this.splice(this._enquali,i);
        return true;
    }
}
